In [1]:
import numpy as np
import pandas as pd

In [2]:
data={'Country':['India','USA','Japan','China','India','USA'],
      'Year':['2010','2010','2010','2015','2015','2015'],
      'Continent':['Asia','NA','Asia','Asia','Asia','NA'],
      'Value':[20,10,40,50,60,55]
     }

In [3]:
df=pd.dataframe(data)

AttributeError: module 'pandas' has no attribute 'dataframe'

In [ ]:
df=pd.Dataframe(data)

AttributeError: module 'pandas' has no attribute 'Dataframe'

In [ ]:
df=pd.DataFrame(data)

In [ ]:
df

  Country  Year Continent  Value
0   India  2010      Asia     20
1     USA  2010        NA     10
2   Japan  2010      Asia     40
3   China  2015      Asia     50
4   India  2015      Asia     60
5     USA  2015        NA     55

In [ ]:
people1={'id':[1,2,3,4],
         'name':['ab','rf','kl','ed'],
         'age':[45,25,41,30]
        }
people2={'id':[11,22,33,44],
         'name':['awb','rgf','kal','ejd'],
         'age':[45,25,41,30]
        }
people3={'id':[111,222,333,444],
         'name':['oab','rnf','kml','ecd'],
         'age':[55,75,81,50]
        }

In [ ]:
df1=pd.DataFrame(people1)
df2=pd.DataFrame(people2)
df3=pd.DataFrame(people3)

In [ ]:
df1

   id name  age
0   1   ab   45
1   2   rf   25
2   3   kl   41
3   4   ed   30

In [ ]:
df2

   id name  age
0  11  awb   45
1  22  rgf   25
2  33  kal   41
3  44  ejd   30

In [ ]:
df3

    id name  age
0  111  oab   55
1  222  rnf   75
2  333  kml   81
3  444  ecd   50

In [ ]:
pd.contact([df1,df2,df3],ignore_index=true)

AttributeError: module 'pandas' has no attribute 'contact'

In [ ]:
pd.contat([df1,df2,df3],ignore_index=true)

AttributeError: module 'pandas' has no attribute 'contat'

In [ ]:
pd.concat([df1,df2,df3],ignore_index=true)

NameError: name 'true' is not defined

In [ ]:
pd.concat([df1,df2,df3],ignore_index=True)

     id name  age
0     1   ab   45
1     2   rf   25
2     3   kl   41
3     4   ed   30
4    11  awb   45
5    22  rgf   25
6    33  kal   41
7    44  ejd   30
8   111  oab   55
9   222  rnf   75
10  333  kml   81
11  444  ecd   50

In [ ]:
name   age		roll
'akash'	21		100
'akshat'	22		101
'sunny'	24		102
'bunny'	23		103
'ashish'	25		104

:

In [ ]:
pd.concat([df1,df2,df3],ignore_index=True)

NameError: name 'pd' is not defined